Repository: rafaelSwi/TCC-Uniavan
Catalog: Código-Fonte/flutter/lib/l10n/app_*.arb
Languages: es, pt

# errorLoadingUsers
source: An error occurred while loading users
es: Se ha producido un error al cargar usuarios
pt: Ocorreu um erro ao carregar os usuários

# errorLoadingLocations
source: An error occurred while loading locations
es: Se ha producido un error al cargar las ubicaciones
pt: Ocorreu um erro ao carregar as localizações

# errorLoadingSchedules
source: An error occurred while loading schedules
es: Se ha producido un error al cargar los cronogramas
pt: Ocorreu um erro ao carregar as agendas

# errorOpeningUserMaybeCpfIsWrong
source: An error occurred when opening more details for this user, maybe the CPF entered is wrong.
es: Se ha producido un error al abrir más detalles de este usuario, quizás el CPF introducido es incorrecto
pt: Ocorreu um erro ao abrir mais detalhes deste usuário, talvez o CPF inserido esteja errado.

# notPossibleToCreateAdminUser
source: For security reasons, it is not possible to create a user with administrative permissions.
es: Por motivos de seguridad, no es posible crear un usuario con permisos de administrador
pt: Por motivos de segurança, não é possível criar um usuário com permissões de administrador.

# notPossibleToCreateActivity
source: You do not have permission to create a new activity.
es: No tiene permiso para crear una nueva actividad
pt: Você não possui permissão para criar uma nova atividade.

# notPossibleToCreateLocation
source: You do not have permission to create a new location.
es: No tiene permisos para crear una nueva ubicación
pt: Você não possui permissão para criar uma nova localização.

# notPossibleToCreateProject
source: You do not have permission to create a new project.
es: No tiene permiso para crear un nuevo proyecto
pt: Você não possui permissão para criar um novo projeto.

# notPossibleToCreateSchedule
source: You do not have permission to create a new schedule.
es: No tiene permiso para crear un nuevo cronograma
pt: Você não possui permissão para criar uma nova agenda.

source: Search by description
es: Buscar por descripción
pt: Pesquisar por descrição

source: Show completed activities
es: Mostrar actividades completadas
pt: Mostrar atividades concluídas

source: Show deprecated locations
es: Mostrar ubicaciones descartadas
pt: Mostrar localizações descartadas

source: Show only overdue projects
es: Mostrar sólo proyectos atrasados
pt: Mostrar apenas projetos em atraso

source: Filter
es: Filtro
pt: Filtrar

source: Password
es: Contraseña
pt: Senha

source: Search by name
es: Buscar por nombre
pt: Pesquisar por nome

source: No Schedule Available
es: No hay calendario disponible
pt: Nenhuma Agenda Disponível

# searchByCpf
source: CPF Search
es: Búsq. por CPF
pt: Busca por CPF

# selectPermission
source: Select a Permission
es: Seleccionar un permiso
pt: Selecionar uma Permissão

# selectTheme
source: Select a Theme
es: Seleccionar apariencia
pt: Selecionar um Tema

# selectSchedule
source: Select a Schedule
es: Seleccionar un cronograma
pt: Selecionar uma Agenda

# selectRole
source: Select a Role
es: Selecciona un Cargo
pt: Selecionar um Cargo

source: Selection
es: Selección
pt: Seleção

source: Unfinished Projects
es: Proyectos en curso
pt: Projetos em andamento

source: No Unfinished Projects
es: No hay proyectos en curso
pt: Sem projetos em andamento

source: Note
es: Observación
pt: Observação

source: Refresh
es: Recargar
pt: Recarregar

source: Close
es: Salir
pt: Fechar

source: Warning
es: Alerta
pt: Aviso

source: Alert
es: Alerta
pt: Alerta

source: Search
es: Buscar
pt: Pesquisar

source: Add
es: Añadir
pt: Adicionar

source: Add Chunk
es: Añadir Chunk
pt: Adic. Pedaço

source: Main Information
es: Información principal
pt: Informação Principal

# insertMainInformation
source: INSERT MAIN INFO.
es: INSERTAR INFORMACION PRINCIPAL
pt: INSERIR INFO. PRINCIPAL

source: Secondary Information
es: Información secundaria
pt: Informação Secundária

source: In Progress
es: En Curso
pt: Em Andamento

# inProgressAbbreviated
source: In Pr.
es: En c.
pt: Em And.

# activeAbbreviated
source: Act.
pt: Ativ.

# activitiesReallyAbbreviatedAndUpperCased
source: ACT.
pt: ATI.

# rainReallyAbbreviatedAndUpperCased
source: RAI.
es: LLU.
pt: CHU.

source: Reset Search
es: Restablecer búsqueda
pt: Redefinir Pesquisa

source: Available
es: Disponible
pt: Disponível

source: Marked
es: Marcado
pt: Marcado

source: Update
es: Actualizar
pt: Atualizar

source: Creator
es: Creador
pt: Criador

source: Responsible
es: Responsable
pt: Responsável

source: CPF registration update
es: Actualización del registro del CPF
pt: Atualização de registro de CPF

# requestToUpdateCpf
source: The request to update this user's CPF was sent to the server.
es: Se ha enviado al servidor la solicitud de actualización del CPF de este usuario
pt: A solicitação para atualizar o CPF deste usuário foi enviada ao servidor.

# requestToUpdateProject
source: The request to update the project was sent to the server.
es: Se ha enviado al servidor la solicitud de actualización del proyecto
pt: A solicitação para atualizar o projeto foi enviada ao servidor.

# requestToUpdateSchedule
source: The request to update this user's schedule was sent to the server.
es: La solicitud para actualizar el cronograma de este usuario ha sido enviada al servidor
pt: A solicitação para atualizar a agenda deste usuário foi enviada ao servidor.

# requestToCompleteActivity
source: The request to mark this activity as completed has been sent to the server.
es: Se ha enviado al servidor la solicitud para marcar esta actividad como completada
pt: A solicitação para marcar esta atividade como concluída foi enviada ao servidor.

# errorWhileCompletingActivity
source: Unable to complete this activity.
es: No se ha podido completar esta actividad
pt: Não foi possível concluir esta atividade.

# errorWhileCompletingActivityCheckForMore
source: Unable to complete this activity, check for ongoing restrictions and/or all chunks have been completed.
es: No se ha podido completar esta actividad, comprueba si hay alguna restricción en curso y/o si se han completado todos los chunks
pt: Não foi possível concluir esta atividade, verifique se há restrições em andamento e/ou se todos os pedaços foram concluídos.

# errorWhileUpdatingCpf
source: An unexpected problem occurred when trying to update this user's CPF.
es: Se ha producido un problema al intentar actualizar el CPF de este usuario
pt: Ocorreu um problema inesperado ao tentar atualizar o CPF deste usuário.

# errorWhileUpdatingProject
source: An unexpected problem occurred when trying to update this project.
es: Se ha producido un problema al intentar actualizar este proyecto
pt: Ocorreu um problema inesperado ao tentar atualizar este projeto.

# errorWhileUpdatingSchedule
source: An unexpected problem occurred when trying to update this user's schedule.
es: Hubo un problema al actualizar el cronograma de este usuario.
pt: Ocorreu um problema inesperado ao tentar atualizar a agenda deste usuário.

source: Current CPF
es: CPF actual
pt: CPF Atual

source: Insert CPF
es: Insertar CPF
pt: Insira o CPF

# thisActivityHasRestrictions
source: The current activity/chunk has restrictions, and these restrictions must be completed first.
es: La actividad/chunk actual tiene restricciones y estas restricciones deben completarse primero.
pt: Esta atividade ou pedaço possui restrições, e essas restrições devem ser concluídas primeiro.

# cpfChangesTakesTime
source: CPF changes may take some time to be completely processed by the server.
es: Los cambios de CPF no son instantáneos
pt: Alterações de CPF não são instantâneas

# nameChangesTakesTime
source: Name changes are not instantaneous and may take time to be fully processed
es: Los cambios de nombre no son instantáneos y pueden tardar algún tiempo en procesarse
pt: Alterações de nome não são instantâneas e podem levar algum tempo para serem processadas

# roleChangesTakesTime
source: Role changes are not instantaneous and may take time to be fully processed
es: Los cambios de rol no son instantáneos y pueden tardar algún tiempo en procesarse
pt: Alterações de cargo não são instantâneas e podem levar algum tempo para serem processadas

# scheduleChangesTakesTime
source: Schedule changes are not instantaneous and may take some time to be completely processed by the server.
es: Los cambios de cronograma no son instantáneos y pueden tardar algún tiempo en procesarse
pt: Alterações de agenda não são instantâneas e podem levar algum tempo para serem processadas

# activitiesAndModeratorsWillBeAddedToTheExistingProject
source: Selected activities and moderators will be added to the existing project.
es: Se añadirán actividades y moderadores al proyecto existente
pt: As atividades e moderadores selecionados serão adicionados ao projeto existente.

# notPossibleToRemoveActivitiesOrModeratorsFromCreatedProjects
source: You CANNOT REMOVE activities or moderators from created projects.
es: No se pueden eliminar actividades o moderadores de los proyectos creados
pt: Você não pode remover atividades ou moderadores de projetos criados.

source: Update CPF
es: Actualizar CPF
pt: Atualizar CPF

source: Update Project
es: Modificar proyecto
pt: Modificar Projeto

source: Update Activity
es: Modificar Actividad
pt: Modificar Atividade

source: Name
es: Nombre
pt: Nome

source: Name Update
es: Actualizar Nombre
pt: Atualização de Nome

# requestToUpdateName
source: The request to update this user's name was sent to the server.
es: Se ha enviado al servidor la solicitud para actualizar el nombre de este usuario
pt: A solicitação para atualizar o nome deste usuário foi enviada ao servidor.

# errorWhileUpdatingName
source: An unexpected problem occurred when trying to update this user's name.
es: Se ha producido un problema inesperado al intentar actualizar el nombre de este usuario
pt: Ocorreu um problema inesperado ao tentar atualizar o nome deste usuário.

source: Current Name
es: Nombre actual
pt: Nome Atual

source: Update Name
es: Actualizar nombre
pt: Atualizar Nome

source: Remember CPF
es: Guardar mi CPF
pt: Lembrar meu CPF

# permAdminDesc
source: If there is a button to be pressed, the administrator can press it, and things will happen.
es: Si hay un botón que hace algo, puede estar seguro de que el administrador puede presionar ese botón.
pt: Um Administrador tem controle total do sistema.

# permManagerDesc
source: A manager can create and manage Projects, Locations, Activities, etc. However, he cannot change users' personal data, such as permissions.
es: Un administrador puede crear y gestionar Proyectos, Ubicaciones, Actividades, etc. Sin embargo, no pueden cambiar los datos personales de los usuarios, como los permisos.
pt: Um gerente pode criar e gerenciar Projetos, Localizações, Atividades, etc. No entanto, ele não pode alterar os dados pessoais dos usuários, como permissões.

# permWorkerDesc
source: Worker has adequate permissions to use the system, but without detailed management of activities, projects and users.
es: El trabajador tiene permisos adecuados para utilizar el sistema, pero no gestión detallada de actividades, proyectos y usuarios
pt: O trabalhador possui permissões adequadas para utilizar o sistema, mas sem gerenciamento detalhado de atividades, projetos e usuários.

# permRestrictedDesc
source: A restricted user cannot perform absolutely any action within the system, whether viewing or managing.
es: Un usuario restringido no puede realizar absolutamente ninguna acción dentro del sistema, ni de visualización ni de gestión
pt: Um usuário restrito não pode realizar absolutamente nenhuma ação dentro do sistema, seja visualizando ou gerenciando.

# selectPermissionToReadItsDescription
source: Select a permission to read its description.
es: Selecciona un permiso para leer su descripción
pt: Selecione uma permissão para ler sua descrição.

# permUpdate
source: User permission update
es: Actualización de permisos de usuario
pt: Atualização de permissão do usuário

# permError
source: Permission Error
es: Error de permiso
pt: Erro de Permissão

# youDontHavePerm
source: You do not have sufficient permissions to perform this action.
es: No tienes permisos suficientes para realizar esta acción
pt: Você não possui permissões suficientes para realizar esta ação.

# requestToUpdatePerm
source: The request to update permissions was sent to the server.
es: Se ha enviado al servidor la solicitud de actualización de permisos
pt: A solicitação para atualizar as permissões foi enviada ao servidor.

# errorWhileUpdatingPerm
source: An unexpected problem occurred when trying to update this user's permissions.
es: Se ha producido un problema inesperado al intentar actualizar los permisos de este usuario
pt: Ocorreu um problema inesperado ao tentar atualizar as permissões deste usuário.

# errorWhileUpdatingActivity
source: An unexpected problem occurred when trying to update this activity.
es: Se ha producido un problema inesperado al intentar actualizar esta actividad
pt: Ocorreu um problema inesperado ao tentar atualizar esta atividade.

source: Update user permission
es: Actualizar permiso de usuario
pt: Atualizar permissão do usuário

# minCharactersAcceptedInPassword
source: Minimum number of characters in a password:
es: Número mínimo de caracteres en la contraseña:
pt: Número mínimo de caracteres na senha:

# passwordUpdate
source: User password update
es: Actualizar contraseña de usuario
pt: Atualização de senha do usuário

source: Permission
es: Permiso
pt: Permissão

# requestToUpdatePassword
source: The request to update this user's password was sent to the server.
es: Se ha enviado al servidor la solicitud para actualizar la contraseña de este usuario
pt: A solicitação para atualizar a senha deste usuário foi enviada ao servidor.

# requestToUpdateActivity
source: The request to update this activity was sent to the server.
es: Se ha enviado al servidor la solicitud para actualizar esta actividad
pt: A solicitação para atualizar esta atividade foi enviada ao servidor.

# errorWhileUpdatingPassword
source: An unexpected problem occurred when trying to update this user's password.
es: Se ha producido un problema inesperado al intentar actualizar la contraseña de este usuario
pt: Ocorreu um problema inesperado ao tentar atualizar a senha deste usuário.

# updateUserPassword
source: Update password
es: Actualizar contraseña
pt: Atualizar senha

source: Password updates do not revoke active Tokens.
es: Las actualizaciones de contraseña no revocan los tokens activos
pt: As atualizações de senha não revogam os Tokens ativos.

# roleUpdate
source: User role update
es: Actualización de rol de usuario
pt: Atualização de cargo do usuário

# requestToUpdateRole
source: The request to update this user's role was sent to the server.
es: La solicitud para actualizar el rol de este usuario ha sido enviada al servidor
pt: A solicitação para atualizar a cargo deste usuário foi enviada ao servidor.

# errorWhileUpdatingRole
source: An unexpected problem occurred when trying to update this user's role.
es: Se ha producido un problema al intentar actualizar el rol de este usuario
pt: Ocorreu um problema ao tentar atualizar a cargo deste usuário.

# updateUserRole
source: Update role
es: Actualizar rol
pt: Atualizar Cargo

source: Update Schedule
es: Actualizar cronograma
pt: Atualizar Agenda

# scheduleUpdate
source: User schedule update
es: Actualizar cronograma del usuario
pt: Atualização de agenda do usuário

# updateUserSchedule
source: Update Schedule
es: Actualizar cronograma
pt: Atualizar Agenda

# usersAffectedByChange
source: Users affected by the change
es: Usuarios afectados
pt: Usuários afetados

source: Created
es: Creado
pt: Criado

source: View Progress
es: Ver progreso
pt: Visualizar Progresso

# cantCloneActivity
source: Unable to clone activity
es: No se puede clonar la actividad
pt: Não é possível clonar a atividade

source: Creator Information
es: Información del creador
pt: Informações do Criador

source: Responsible Information
es: Información del responsable
pt: Informações do Responsável

source: Modify activity attributes
es: Modificar actividad
pt: Modificar atividade

source: Modify project attributes
es: Modificar proyecto
pt: Modificar projeto

# activityAlreadyDone
source: Activity already completed
es: Actividad ya realizada
pt: Atividade já concluída

# cannotModifyActivitiesThatHaveAlreadyBeenCompleted
source: You cannot modify activities that have already been completed
es: No se pueden modificar actividades que ya se han completado
pt: Você não pode modificar atividades que já foram concluídas

source: Location Information
es: Información de ubicación
pt: Informações da Localização

source: Mark Done
es: Marcar como completada
pt: Marcar como Concluído

# navigateHorizontallyControlsTip
source: Navigate horizontally (A, D, ←, →) and adjust zoom with ﹣ and ﹢.
es: Navega horizontalmente (A, D, ←, →) y ajusta el zoom con - y ﹢
pt: Navegue horizontalmente (A, D, ←, →) e ajuste o zoom com ﹣ e ﹢.

# navigateHorizontallyTouchTip
source: Navigate horizontally smoothly using your laptop's touchpad.
es: Navega horizontalmente con suavidad usando el touchpad
pt: Navegue horizontalmente suavemente usando o touchpad do seu notebook.

source: Navigation
es: Navegación
pt: Navegação

source: Custom Widget
es: Widget personalizado
pt: Widget Personalizado

source: Default Widget with custom colors
es: Widget por defecto con colores personalizados
pt: Widget Padrão com cores personalizadas

source: Contrast
es: Contraste
pt: Contraste

# showWeeekDays
source: Show Week Days
es: Mostrar días de la semana
pt: Mostrar Dias da Semana

source: Show Activities
es: Mostrar actividades
pt: Mostrar Atividades

source: Show Projects
es: Mostrar proyectos
pt: Mostrar Projetos

source: Discard
es: Descartar
pt: Descartar

source: Deprecate
es: Descartar
pt: Descartar

source: Discard location? This action cannot be undone.
es: ¿Descartar ubicación? Esta acción no se puede deshacer
pt: Descartar localização? Esta ação não pode ser desfeita.

source: Average labor cost
es: Costo laboral promedio
pt: Custo médio de mão de obra

source: Language
es: Idioma
pt: Idioma Geral

# languageDesc
source: Restart required
es: Requiere reinicialización
pt: Reinicialização necessária

# orangeTheme
source: Builder
es: Obrero
pt: Laranja

# greenTheme
source: Florest
es: Bosque
pt: Verde Floresta

# grayTheme
source: Metal
pt: Cinza Metálico

# blueTheme
source: Ocean
es: Océano
pt: Azul Oceano

# darkTheme
source: Cinnamon Dark
es: Canela
pt: Canela (Escuro)

# portuguese
source: Portuguese (Português)
es: Portugués (Português)
pt: Português Brasileiro

# english
source: English (English)
es: Inglés (English)
pt: Inglês (English)

# spanish
source: Spanish (Español)
es: Español (Spanish)
pt: Espanhol (Español)

source: Price
es: Precio
pt: Preço

source: Materials
es: Materiales
pt: Materiais

source: Select Materials
es: Seleccionar Materiales
pt: Selecionar Materiais

# averageLaborCostInReais
source: Average labor cost (R$)
es: Costo promedio de mano de obra (R$)
pt: Custo médio da mão de obra (em R$)

# requestToCreateMaterialSent
source: The request to create this material has been sent to the system.
es: La solicitud para crear este material ha sido enviada al sistema.
pt: A solicitação para criar este material foi enviada ao sistema.

# errorWhileCreatingMaterial
source: An error occurred while creating this material.
es: Ocurrió un problema al crear este material.
pt: Ocorreu um problema ao criar este material.

source: Create Material
es: Crear Material
pt: Criar Material

source: Material Name
es: Nombre del Material
pt: Nome do Material

# averagePriceInReais
source: Average price (R$)
es: Precio promedio (R$)
pt: Preço médio (em R$)

source: Average Price
es: Precio promedio
pt: Preço médio

source: Average Price Reference
es: Referencia del precio promedio
pt: Referência do preço médio

source: In Stock
es: En Stock
pt: Em Estoque

source: Out of Stock
es: Sin stock
pt: Sem estoque

source: No materials found
es: No se encontraron materiales
pt: Nenhum material encontrado

# youCannotCreateNewMaterial
source: You cannot create a new material.
es: No puedes crear un nuevo material.
pt: Você não pode criar um novo material.

source: Logout
es: Salir

source: Server
es: Serv.

source: Original
es: Previo
