Repository: rafaelSwi/TCC-Uniavan
Catalog: Código-Fonte/flutter/lib/l10n/app_*.arb
Languages: es, pt

# contactAdministratorToCreateAnAccount
source: To create an account you must contact an administrator.
es: Para crear una cuenta, debes ponerte en contacto con un administrador
pt: Para criar uma conta, você deve entrar em contato com um administrador.

# connectivityWithTheServer
source: Server connectivity:
es: Conectividad con el servidor:
pt: Conectividade com o servidor:

source: About
es: Información
pt: Sobre

source: Version
es: Versión
pt: Versão

source: Connectivity Error
es: Error de conectividad
pt: Erro de Conectividade

# couldNotEstablishServerConnection
source: Could not establish a connection to the server.
es: No se pudo establecer la conexión con el servidor
pt: Não foi possível estabelecer uma conexão com o servidor.

source: Permission Error
es: Error de permiso
pt: Erro de Permissão

# permissionErrorDesc
source: Your user does not have sufficient permissions to perform this action.
es: Su usuario no tiene permisos suficientes para realizar esta acción
pt: Seu usuário não possui permissões suficientes para realizar esta ação.

source: Error
pt: Erro

source: Done
es: Completado
pt: Concluído

source: Something went wrong
es: Algo salió mal
pt: Algo deu errado

# someLoginError
source: There was a problem with the login process
es: Hubo un problema con el proceso de inicio de sesión
pt: Ocorreu um problema no processo de login

# connectionEstablishedButLoginFailed
source: The connection to the server was established, but the login failed.
es: Se estableció la conexión con el servidor, pero falló el inicio de sesión
pt: A conexão com o servidor foi estabelecida, mas o login falhou.

source: Interface Scale
es: Escala de interfaz
pt: Escala da Interface

# interfaceScaleDesc
source: Experimental, may present problems
es: Experimental, puede presentar problemas
pt: Experimental, pode apresentar problemas

# def
source: Default
es: Estándar
pt: Padrão

# closeButtonLabel
source: "X" Button
es: Botón "X"
pt: Botão "X"

# closeButtonLabelDesc
source: "X" Button Label
es: Texto del botón "X"
pt: Texto do Botão "X"

source: Back
es: Volver
pt: Voltar

# goBack
source: Close
es: Salir
pt: Fechar

source: Empty
es: Vacío
pt: Vazio

source: Confirm
es: Confirmar
pt: Confirmar

source: Invalid Request
es: Solicitud no válida
pt: Requisição Inválida

source: This location is already marked as discarded.
es: Esta ubicación ya está marcada como descartada
pt: Esta localização já está marcada como descartada.

source: This schedule is already marked as discarded.
es: Este cronograma ya está marcado como descartado
pt: Esta agenda já está marcada como descartada.

source: Appearance
es: Apariencia
pt: Aparência

# appearanceDesc
source: Change it on the login screen
es: Cambiar solo en la pantalla de inicio
pt: Altere na tela de login

source: Current Host
es: Host actual
pt: Host Atual

source: IP Address
es: IP
pt: Endereço IP

source: Port
pt: Porta

source: Chunk
pt: Pedaço

source: Chunks
pt: Pedaços

source: HTTP Secure
es: HTTPS
pt: HTTP Seguro

source: Apply Port
es: Aplicar PORT
pt: Aplicar Porta

source: Apply new host
es: Aplicar nuevo host
pt: Aplicar novo host

source: Empty fields
es: Campos vacíos
pt: Campos vazios

# readInPortuguese
source: Read in Portuguese (Português)
es: Leer en portugués
pt: Ler em Português (Portuguese)

# readInEnglish
source: Read in English (Inglês)
es: Leer en inglés
pt: Ler em Inglês (English)

# fillAllToCreateActivity
source: Fill in all the fields to create an activity.
es: Rellenar todos los campos para crear una actividad
pt: Preencha todos os campos para criar uma atividade.

# fillAllToCloneActivity
source: Fill in all the fields to clone this activity.
es: Rellene todos los campos para clonar esta actividad
pt: Preencha todos os campos para clonar esta atividade.

# fillAllToCreateUser
source: Fill in all the fields to create this user.
es: Rellena todos los campos para crear este usuario
pt: Preencha todos os campos para criar este usuário.

source: Activity
es: Actividad
pt: Atividade

# requestToCreateActivitySent
source: The Request to create this activity has been created.
es: Se ha creado la solicitud para crear esta actividad
pt: A solicitação para criar esta atividade foi enviada ao sistema.

# requestToDeprecateLocationSent
source: The Request to deprecate this location has been sent.
es: Se ha enviado la solicitud para eliminar esta ubicación
pt: A solicitação para descartar esta localização foi enviada.

# requestToDeprecateScheduleSent
source: The Request to deprecate this schedule has been sent.
es: Se ha enviado la solicitud para descartar este cronograma
pt: A solicitação para descartar esta agenda foi enviada.

# requestToCloneActivitySent
source: The Request to clone this activity has been created.
es: Se ha enviado la solicitud para clonar esta actividad
pt: A solicitação para clonar esta atividade foi enviada ao sistema.

# requestToCreateUserSent
source: The Request to create this user has been created.
es: Se ha enviado la solicitud para crear este usuario
pt: A solicitação para criar este usuário foi enviada ao sistema.

# errorWhileCreatingActivity
source: There was a problem trying to create the activity.
es: Se ha producido un problema al intentar crear la actividad
pt: Ocorreu um problema ao tentar criar a atividade.

# errorWhileDeprecateLocation
source: There was a problem trying to deprecate this location.
es: Se ha producido un problema al intentar eliminar esta ubicación
pt: Ocorreu um problema ao tentar descartar esta localização.

# errorWhileDeprecateSchedule
source: There was a problem trying to deprecate this schedule.
es: Se ha producido un problema al intentar descartar este cronograma
pt: Ocorreu um problema ao tentar descartar esta agenda.

# errorWhileCreatingChunk
source: There was a problem creating a location chunk.
es: Se produjo un problema al crear un chunk de esta ubicación
pt: Ocorreu um problema ao criar um pedaço desta localização.

# errorWhileDeletingChunk
source: There was a problem deleting this chunk.
es: Se ha producido un problema al borrar este chunk
pt: Ocorreu um problema ao excluir este pedaço.

# errorWhileUpdatingChunk
source: There was a problem updating this chunk.
es: Se ha producido un problema al actualizar este chunk
pt: Ocorreu um problema ao atualizar este pedaço.

# errorWhileCloningActivity
source: There was a problem trying to clone this activity.
es: Se ha producido un problema al intentar clonar esta actividad
pt: Ocorreu um problema ao tentar clonar esta atividade.

source: Create Activity
es: Crear actividad
pt: Criar Atividade

source: Clone Activity
es: Clonar actividad
pt: Clonar Atividade

source: Working Hours
es: Tiempo
pt: Horas

source: Edit
es: Editar
pt: Editar

source: Details
es: Detalles
pt: Detalhes

source: Delete
es: Borrar
pt: Excluir

source: Delete this chunk?
es: ¿Borrar?
pt: Excluir este pedaço?

source: Employee
es: Empleado
pt: Funcionário

source: Employees
es: Empleados
pt: Funcionários

source: Restriction
es: Restricción
pt: Restrição

source: Restrictions
es: Restricciones
pt: Restrições

source: Unresolved
es: Pendiente
pt: Pendência

# someInformationNeedsToBeFilled
source: Some information needs to be filled in to continue.
es: Es necesario completar algunos datos para continuar
pt: Algumas informações precisam ser preenchidas para continuar.

source: Selected
es: Seleccionado
pt: Selecionado

# selectedPlural
source: Selected
es: Seleccionado(s)
pt: Selecionado(s)

source: Select Employees
es: Seleccionar empleados
pt: Selecionar Funcionários

source: Select Moderators
es: Seleccionar moderadores
pt: Selecionar Moderadores

source: Select activities
es: Seleccionar actividades
pt: Selecionar Atividades

# selectInCaseOfRain
source: Select activities for rainy days
es: Seleccionar actividades (lluvia)
pt: Selecionar atividades para situações de chuva

source: Select Restrictions
es: Seleccionar restricciones
pt: Selecionar Restrições

# restrictionsMustBeManuallySelected
source: Restrictions must be manually selected, even in case of cloning.
es: Las restricciones deben seleccionarse manualmente, incluso en caso de clonación
pt: As restrições devem ser selecionadas manualmente, mesmo em caso de clonagem.

source: Description
es: Descripción
pt: Descrição

# professionalAmount
source: Professionals Amount
es: Número de profesionales
pt: Quantidade de Profissionais

source: Labourer Amount
es: Número de sirvientes
pt: Quantidade de Serventes

source: Minutes for each professional
es: Minutos por cada profesional
pt: Minutos para cada profissional

source: Minutes for each labourer
es: Minutos por cada sirvientes
pt: Minutos para cada servente

source: Start Date
es: Fecha de inicio
pt: Data de Início

source: Start
es: Inicio
pt: Início

source: Deadline Date
es: Fecha límite
pt: Data do Prazo

source: Deadline
es: Límite
pt: Prazo

# selectActivityLocation
source: Select the location of this activity
es: Seleccione la ubicación de esta actividad
pt: Selecione a localização desta atividade

source: Selected location
es: Ubicación seleccionada
pt: Localização selecionada

source: Show
es: Mostrar
pt: Mostrar

source: Deprecated
es: Desactivado
pt: Desativado

source: Deprecate Location
es: Descartar ubicación
pt: Descartar Localização

# deprecateThisLocation
source: Deprecate this location? This action cannot be reversed.
es: ¿Descartar esta ubicación? Esta acción no se puede deshacer
pt: Descartar esta localização? Esta ação não pode ser desfeita.

source: Deprecate Schedule
es: Descartar cronograma
pt: Descartar Agenda

# deprecateThisSchedule
source: Deprecate this schedule? This action cannot be reversed.
es: ¿Descartar este cronograma? Esta acción no se puede deshacer
pt: Descartar esta agenda? Esta ação não pode ser desfeita.

# associateWithSameProjects
source: Associate with the same projects?
es: ¿Asociar con los mismos proyectos?
pt: Associar aos mesmos projetos?

# youCannotCreateNewUser
source: You cannot create a new user.
es: No se puede crear un nuevo usuario
pt: Você não pode criar um novo usuário.

# nameColumnLabel
source: Name column label (Default: 'Nome')
es: Columna de Nombre (Predeterminado: 'Nome')
pt: Texto da coluna de Nome (Padrão: 'Nome')

# durationColumnLabel
source: Duration column label (Default: 'Duração')
es: Columna de Duración (Predeterminado: 'Duração')
pt: Texto da coluna de Duração (Padrão: 'Duração')

source: Select Sheet File
es: Seleccionar archivo de hoja
pt: Selecionar Arquivo de Planilha

source: Select File
es: Seleccionar archivo
pt: Selecionar Arquivo

source: Only "xlsx" files will work.
es: Sólo se admiten archivos "xlsx"
pt: Somente arquivos "xlsx" são compatíveis

source: In Minutes
es: En minutos
pt: Em Minutos

source: In Hours
es: En Horas
pt: Em Horas

source: Yes
es: Sí
pt: Sim

source: No
pt: Não

source: Select Chunks
es: Seleccionar chunks
pt: Selecionar Pedaços

source: Previously selected
es: Seleccionado anteriormente
pt: Selecionados anteriormente

source: None selected
es: Ninguno seleccionado
pt: Nenhum selecionado

source: Optional
es: Opcional
pt: Opcional

source: No reference
es: Sin referencia
pt: Sem referência

# selectLocationFirst
source: You need to choose a location first.
es: Tienes que elegir primero una ubicación
pt: Você precisa escolher uma localização primeiro.

# fillEverythingFirst
source: Complete the entire procedure.
es: Completa todo el procedimiento
pt: Complete todo o procedimento.

source: Location
es: Ubicación
pt: Localização

source: Locations
es: Ubicaciones
pt: Localizações

# requestToCreateLocationSent
source: The Request to create this location has been created.
es: Se ha creado la solicitud para crear esta ubicación
pt: A solicitação para criar esta localização foi enviada.

# errorWhileCreatingLocation
source: There was a problem trying to create the location.
es: Se ha producido un problema al intentar crear la ubicación
pt: Ocorreu um problema ao tentar criar a localização.

# errorWhileOpeningUserSchedule
source: An error occurred while opening more information about this user's schedules.
es: Se ha producido un error al abrir más información sobre los cronogramas de este usuario
pt: Ocorreu um erro ao abrir mais informações sobre as agendas deste usuário.

source: Create Location
es: Crear ubicación
pt: Criar Localização

source: Enterprise
es: Empresa
pt: Empresa

source: Project
es: Proyecto
pt: Projeto

source: Role
es: Posición
pt: Cargo

source: Projects
es: Proyectos
pt: Projetos

# noProjects
source: No Projets
es: No Projects
pt: Sem Projetos

source: Project Title
es: Título del Proyecto
pt: Título do Projeto

source: Full Title
es: Título completo
pt: Título Inteiro

source: Date when it was marked as completed
es: Fecha en la que se marcó como completado
pt: Data em que foi marcado como concluído

# markedAsCompletedby
source: Marked as completed by the following user
es: Marcado como completado por el siguiente usuario
pt: Marcado como concluído pelo seguinte usuário

# userHasAlreadyMarkedThisChunkAsComplete
source: A user has already marked/unmarked this chunk as completed at some point.
es: Un usuario ya ha marcado/desmarcado este chunk en algún momento.
pt: Um usuário já marcou/desmarcou este pedaço como completo em algum momento.

# noInfo
source: No Information
es: Sin información
pt: Sem informação

source: Selected date
es: Fecha seleccionada
pt: Data selecionada

# yesUndo
source: Yes, continue
es: Sí, quiero deshacer
pt: Sim, desfazer

# confirmWithCurrentDate
source: Confirm with today's date
es: Confirmar con fecha de hoy
pt: Confirmar com a data de hoje

source: Confirm with selected date
es: Confirmar con fecha seleccionada
pt: Confirmar com a data selecionada

source: Do you want to mark this chunk as complete?
es: ¿Desea marcar este chunk como completado?
pt: Você quer marcar este pedaço como concluído?

# doYouWantToUnmarkThisChunk
source: Undo chunk progress?
es: ¿Deshacer el progreso de este chunk?
pt: Desfazer o progresso deste pedaço?

# doYouWantToUnmarkThisChunkDescription
source: Undoing the progress of this chunk will return it to the "In Progress" status. It is worth mentioning that this action will be recorded in your name.
es: Esta acción quedará registrada con su usuario.
pt: Desfazer o progresso deste pedaço o retornará ao status "Em Andamento". Esta ação será registrada no seu nome.

# clickHereToChooseCustomCompletionDate
source: Click HERE to choose a custom completion date. If the date is today, just click to confirm.
es: Haga clic AQUÍ para elegir una fecha de finalización personalizada. Si la fecha es hoy, simplemente haga clic para confirmar.
pt: Clique NESTE TEXTO para escolher uma data de conclusão diferente. Se a data for hoje, apenas confirme.

# conclusionDate
source: Completion Date
es: Fecha de finalización
pt: Data de conclusão

# chunkHasNoNote
source: This chunk has no notes.
es: Este chunk no tiene observaciones.
pt: Este pedaço não possui observações.

source: Project Completed
es: Proyecto completado
pt: Projeto concluído

# completionDate
source: Finish Date
es: Fecha de Fin.
pt: Data de Final.

source: Action confirmed
es: Acción confirmada
pt: Ação confirmada

source: Swipe to continue, remember this action is irreversible
es: Desliza para continuar, recuerda que esta acción es irreversible
pt: Deslize até o final para continuar, e saiba que esta ação é irreversível

source: Press ESC to exit or click outside the pop-up
es: Presiona ESC para salir o haz clic fuera de la ventana emergente
pt: Pressione ESC para sair ou clique fora do pop-up

# doYouWantToFinishThisProject
source: Do you want to finish the project?
es: ¿Quieres terminar el proyecto?
pt: Deseja finalizar o projeto?

source: Not completed
es: No completado
pt: Não finalizado

# itIsNotPossibleToModifyAttributesOfProjectThatHasAlreadyBeenCompleted
source: It is not possible to modify attributes of a project that has already been completed.
es: No es posible modificar los atributos de un proyecto que ya se ha completado.
pt: Não é possível modificar atributos de um projeto que já foi concluído.

# requestToCreateProjectSent
source: The Request to create this project has been created.
es: Se ha creado la solicitud para crear este proyecto
pt: A solicitação para criar este projeto foi enviada.

# errorWhileCreatingProject
source: There was a problem trying to create the project.
es: Se ha producido un problema al intentar crear el proyecto
pt: Ocorreu um problema ao tentar criar o projeto.

source: Create Project
es: Crear proyecto
pt: Criar Projeto

source: Create User
es: Crear usuario
pt: Criar Usuário

# userDetails
source: User Information
es: Información del usuario
pt: Informações do Usuário

source: Schedule
es: Cronograma
pt: Agenda

source: Schedules
es: Cronogramas
pt: Agendas

source: Schedule Title
es: Título del cronograma
pt: Nome da Agenda

source: Change Schedule
es: Cambiar Cronograma
pt: Alterar Agenda

source: Change Role
es: Cambiar cargo
pt: Alterar Cargo

source: Undefined
es: Indefinido
pt: Indefinido

source: Admin
es: Administrador
pt: Administrador

source: Unknown
es: Desconocido
pt: Desconhecido

source: Change Permissions
es: Cambiar permisos
pt: Alterar Permissões

# changeName
source: Change Personal Name
es: Cambiar nombre
pt: Alterar Nome

source: Change CPF
es: Cambiar CPF
pt: Alterar CPF

source: Reset Password
es: Cambiar la contraseña
pt: Redefinir Senha

source: Associated Activities
es: Actividades asociadas
pt: Atividades Associadas

source: Quick Guide
es: Guía
pt: Guia Rápido

source: Spreadsheet Analysis
es: Análisis de Hoja
pt: Análise de Planilha

source: Schedule details
es: Detalles del cronograma
pt: Detalhes da Agenda

# requestToCreateScheduleSent
source: The Request to create this schedule has been created.
es: Se ha creado la solicitud para crear este cronograma
pt: A solicitação para criar esta agenda foi enviada.

# errorWhileCreatingSchedule
source: There was a problem trying to create the schedule.
es: Se ha producido un problema al intentar crear el cronograma
pt: Ocorreu um problema ao tentar criar a agenda.

# errorWhileCreatingUser
source: There was a problem trying to create this user.
es: Se ha producido un problema al intentar crear el usuario
pt: Ocorreu um problema ao tentar criar o usuário.

# errorWhileCollectingUser
source: There was a problem that prevented this user's information from being collected from the server.
es: Se ha producido un problema que ha impedido recopilar la información de este usuario del servidor
pt: Ocorreu um problema que impediu que as informações deste usuário fossem coletadas do servidor.

# errorWhileOpeningUser
source: There was a problem opening more information for this user.
es: Se ha producido un problema al abrir más información para este usuario
pt: Ocorreu um problema ao abrir mais informações para este usuário.

source: Only users with higher permission can modify project attributes.
es: Sólo los usuarios con permisos superiores pueden modificar los atributos del proyecto
pt: Somente usuários com permissão superior podem modificar atributos do projeto.

source: Create Schedule
es: Crear cronograma
pt: Criar Agenda

source: Active
es: Activo
pt: Ativo

source: Moderators
es: Moderadores
pt: Moderadores

source: Activities
es: Actividades
pt: Atividades

# noActivitiesFound
source: No activities were found
es: No se han encontrado actividades
pt: Nenhuma atividade encontrada

# noLocationsFound
source: No locations were found
es: No se han encontrado ubicaciones
pt: Nenhuma localização encontrada

# noSchedulesFound
source: No schedules were found
es: No se han encontrado cronogramas
pt: Nenhuma agenda encontrada

# noUsersFound
source: No users were found
es: No se han encontrado usuarios
pt: Nenhum usuário encontrado

source: Welcome
es: Bienvenido
pt: Bem-vindo

# inCaseOfRain
source: Rainy Day Activities
es: Activ. de lluvia
pt: Em caso de chuva

source: Search employees
es: Buscar empleados
pt: Pesquisar funcionários

source: Search for users to add to the project
es: Buscar usuarios para agregar al proyecto
pt: Pesquisar usuários para adicionar ao projeto

source: Search for activities to add to the project
es: Buscar actividades para agregar al proyecto
pt: Pesquisar atividades para adicionar ao projeto

source: Main responsible
es: Responsable principal
pt: Principal responsável

source: Apply
es: Aplicar
pt: Aplicar

source: Cancel
es: Cancelar
pt: Cancelar

source: Time Selection
es: Selección de hora
pt: Seleção de horário

source: Hour
es: Hora
pt: Hora

source: Minute
es: Minuto
pt: Minuto

source: Invalid
es: No válido
pt: Inválido

source: Clock In
es: Entrada
pt: Entrada

source: Clock Out
es: Salida
pt: Saída

source: Start of Break
es: Inicio de Int.
pt: Início do Int.

source: End of Break
es: Fin de Int.
pt: Fim do Int.

# workBreak
source: Break
es: Intervalo
pt: Intervalo

source: If Any
es: Si exi.
pt: Se existir

# unableToCollectRequiredInfoFromServer
source: Unable to collect required information from server.
es: No hemos podido recopilar la información del servidor
pt: Não foi possível coletar as informações do servidor.

# workBreaks
source: Breaks
es: Intervalos
pt: Intervalos

source: Users using
es: Utilizando
pt: Utilizando

source: Create
es: Crear
pt: Criar

source: Create this Schedule?
es: ¿Crear este cronograma?
pt: Criar esta Agenda?

source: Update this Schedule?
es: ¿Actualizar este cronograma?
pt: Atualizar esta Agenda?

source: Hide restricted users
es: Ocultar usuarios restringidos
pt: Ocultar usuários restritos

source: No Break
es: Sin interv.
pt: Sem Intervalo

source: Select
es: Seleccionar
pt: Selecionar

source: None
es: Ninguno
pt: Nenhum

source: User
es: Usuario
pt: Usuário

source: Users
es: Usuarios
pt: Usuários

source: Profile
es: Perfil
pt: Perfil

source: Professional
es: Profesional
pt: Profissional

source: Professionals
es: Profesionales
pt: Profissionais

source: Amount
es: Cantidad
pt: Quantidade

source: Labourer
es: Sirviente
pt: Servente

source: Labourers
es: Sirvientes
pt: Serventes

source: Assistant
es: Ayudante
pt: Assistente

source: Time
es: Tiempo
pt: Tempo

source: Manager
es: Encargado
pt: Gerente

source: Worker
es: Trabajador
pt: Trabalhador

source: Restricted
es: Restringido
pt: Restrito

# nameWillHaveItsInitialsInCapitalLetters
source: The name will have its initials in capital letters.
es: El nombre tendrá sus iniciales en mayúsculas
pt: O nome terá suas iniciais em letras maiúsculas.

source: The name will be recognized as:
es: El nombre será reconocido como
pt: O nome será reconhecido como:

# errorOpeningActivity
source: It was not possible to open more details about this activity due to a server problem.
es: No ha sido posible abrir más detalles sobre esta actividad debido a un problema del servidor
pt: Não foi possível abrir mais detalhes sobre esta atividade devido a um problema no servidor.

# errorOpeningLocation
source: An error occurred when opening more details for this location
es: Se ha producido un error al abrir más detalles de esta ubicación
pt: Ocorreu um erro ao abrir mais detalhes desta localização

# errorOpeningSchedule
source: An error occurred when opening more details for this schedule
es: Se ha producido un error al abrir más detalles de este cronograma
pt: Ocorreu um erro ao abrir mais detalhes desta agenda

# errorOpeningProject
source: An error occurred when opening more details for this project
es: Se ha producido un error al abrir más detalles de este proyecto
pt: Ocorreu um erro ao abrir mais detalhes deste projeto

# errorOpeningUser
source: An error occurred when opening more details for this user
es: Se ha producido un error al abrir más detalles sobre este usuario
pt: Ocorreu um erro ao abrir mais detalhes deste usuário
